# BuiltInFailures.GroupFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures Class
BuiltInFailures Class Members See Also
---
Failures related to groups and their behavior.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class GroupFailures
```

Visual Basic
---
```text
Public NotInheritable Class GroupFailures
```

Visual C++
---
```text
public ref class GroupFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..GroupFailures
# See Also
BuiltInFailures..::..GroupFailures Members
Autodesk.Revit.DB Namespace